# read design 
read_verilog -sv rtl/ascon_core.sv

# generic synthesis
synth -top ascon_core

# mapping to cmos_cells.lib
dfflibmap -liberty syn/cmos_cells.lib
abc -liberty syn/cmos_cells.lib
clean

# write synthesized design
write_verilog syn.v

stat -liberty syn/cmos_cells.lib
