# read design 
read_verilog -sv rtl/ascon_core.sv

# generic synthesis
synth -top ascon_core

# mapping to cmos_cells.lib
dfflibmap -liberty synth/cmos_cells.lib
abc -liberty synth/cmos_cells.lib
clean

# write synthesized design
write_verilog synth.v

stat -liberty synth/cmos_cells.lib
